app/controllers/admin/home_controller.rb

    def index
        @posts = Post.find_all_by_status("published")
---
SELECT * FROM "posts" WHERE ("posts"."status" = 'published') ORDER BY created_at