app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("permalink", "created_at", "title", "body", "updated_at", "status", "announcement") VALUES('connect-tver-ru-popyitka-izmenit-ryinok-svyazi-v-tveri', '2009-10-18 11:53:17', 'connect.tver.ru - попытка изменить рынок связи в Твери.', '
---
  def create
    @post = Post.new(params[:post])

    if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 12)
---
  def edit
    @post = Post.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 14)
UPDATE "posts" SET "updated_at" = '2009-10-17 22:08:33', "title" = 'www' WHERE "id" = 14
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 12)
---
  def show
    @post = Post.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 259)
DELETE FROM "posts" WHERE "id" = 259
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy