app/controllers/admin/users_controller.rb

  def index
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = '7') LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '7') LIMIT 1

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '7') LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '7') LIMIT 1
UPDATE "users" SET "login_count" = 2, "persistence_token" = 'e63bca0605c34ea1da94f13112a2f78ef7ed62551118853b76ede7f71cb1494108f66f75cae9e3da271676bd343c19f4a29b00f87469043519b209866dab76eb', "updated_at" = '2009-10-19 07:44:54', "last_request_at" = '2009-10-19 07:44:54', "last_login_at" = '2009-10-19 07:16:26', "last_login_ip" = '127.0.0.1', "current_login_at" = '2009-10-19 07:44:54', "password_salt" = '3FAEZS7pHWFoOZBA_UU7', "crypted_password" = 'b0ba7e9d977a9c329a0889a701c94b9e845d143febba8165fc98ba6045c325b498ad0f05c993a166f97501858371263db97b3dfe7ae9ffb15513d667e3cfec65' WHERE "id" = 7