app/controllers/admin/users_controller.rb

SELECT * FROM "users"
---
  def index
    @search = User.search(params[:search])