app/controllers/blog_parameters_controller.rb

  def index
    @blog_parameters = BlogParameter.all
---
SELECT * FROM "blog_parameters"

  def create
    @blog_parameter = BlogParameter.new(params[:blog_parameter])

    respond_to do |format|
      if @blog_parameter.save
---
INSERT INTO "blog_parameters" ("created_at", "updated_at", "value", "description", "key") VALUES('2010-03-27 10:52:32', '2010-03-27 10:52:32', NULL, NULL, NULL)