app/controllers/comments_controller.rb

  def new
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = '--- :first