app/controllers/comments_controller.rb

SELECT * FROM "comments" WHERE ("comments".parent_comment_id = 1) LIMIT 1
---
  def index
    @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments".parent_comment_id = 1) LIMIT 1
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO "comments" ("commenter_email", "created_at", "body", "updated_at", "post_id", "parent_comment_id", "commenter_name") VALUES('igor.alexandrov@gmail.com', '2009-10-16 19:53:20', 'aaaaa', '2009-10-16 19:53:20', 1, 0, 'igor')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save