app/controllers/home_controller.rb

    def index
        @posts = Post.find(:all, :conditions => {:status => "published"}, :order => 'created_at DESC', :include => [:category, :author, :tags])
---
SELECT * FROM "posts" WHERE ("posts"."status" = 'published') ORDER BY created_at DESC